<template>
    <table class="table defaultTable rastersParams">
        <tr>
            <th rowspan="3">Номер колонны в порядке спуска</th>
            <th rowspan="3">Номер части колонны в порядке спуска, (см. таб. 1.5.2, гр.8)</th>
            <th rowspan="3">Номер ступени цементирования (снизу - вверх)</th>
            <th rowspan="3">Наименование технологической операции</th>
            <th rowspan="3">Тип или название жидкости</th>
            <th rowspan="3">Тип (шифр) агрегата или бурового насоса</th>
            <th rowspan="3">Назначение агрегата или бурового насоса</th>
            <th rowspan="3">Количество агрегатов (буровых насосов), работающих на одном режиме</th>
            <th colspan="6">Режим работы агрегатов (буровых) насосов</th>
            <th colspan="2" rowspan="2">Время выполнения технологической операции, мин</th>
        </tr>
        <tr>
            <th rowspan="2">Диаметр цилиндровых втулок, мм.</th>
            <th rowspan="2">Скорость агрегата или число двойных ходов бурового насоса</th>
            <th rowspan="2">Суммарная производительность агрегатов (бурового насосов), л/с</th>
            <th colspan="2">Давление, кгс/см2</th>
            <th rowspan="2">Объем порции на данном режиме</th>
        </tr>
        <tr>
            <th>Допустимое для агрегатов (буровых насосов)</th>
            <th>На устье скважины в конце операции</th>
            <th>В данном режиме</th>
            <th>Нарастающее от начала затворения до момента "стоп"</th>
        </tr>
        <tr>
            <td v-for="i in 16">{{ i+1 }}</td>
        </tr>
        <tr v-for="i in 15">
            <td v-for="i in 16"></td>
        </tr>
    </table>
</template>

<script>
    export default {
        name: "fastening-third"
    }
</script>

<style scoped>

</style>