export default {
    data: function () {
        return {
            wellsTabletNumbers: [13402020, 1440307, 15402010, 1640203],
            wellsTabletMapNames: [
                'Структурная карта + текущих отборов',
                'Карта ННТ + Накопленных отборов',
                'Карта изобар',
                'Сейсмика (ВРС)',
                'Карта ОИЗ',
                'Карта инфраструктуры и поверхности',
                'Карта минерализации',
            ],
            statistics: [
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
                [4320, 7.9, 5.53, 70, 4320, 7.9, 5.53, 70],
            ],
            graphSwitchItems: [
                "Экономика и приоритет сектора",
                "Запасы сектора",
                "Выработка",
                "Текущие показатели добычи нефти, жидкости и закачки воды от времени",
            ],
            ndo: [
                ['ОМГ', '', ''],
                ['ЭМГ', 'Жетыбай', 'Ю-2+3'],
                ['', '', 'Ю-4'],
                ['', '', 'Ю-5'],
                ['', '', 'Ю-6'],
                ['', '', ''],
                ['', '', ''],
                ['', 'Асар', ''],
                ['', 'Каламкас', ''],
            ],
        };
    }
}