<template>
  <div class="table_div">
    <b-table
      bordered
      striped
      :items="items"
      :fields="fields"
      :current-page="currentPage"
      :per-page="perPage"
      style="color: #fff"
    ></b-table>
    <b-row>
      <b-col sm="5" md="6" class="my-1">
        <b-form-group
          label="Показать первые"
          label-for="per-page-select"
          label-cols-sm="6"
          label-cols-md="4"
          label-cols-lg="4"
          label-align-sm="right"
          label-size="sm"
          class="mb-0"
        >
          <b-form-select
            id="per-page-select"
            v-model="perPage"
            :options="pageOptions"
            size="sm"
          ></b-form-select>
        </b-form-group>
      </b-col>
      <div style="margin-left: 180px;" class="pagination">
        <a href="#">&laquo;</a>
        <a href="#">1</a>
        <a class="active" href="#">2</a>
        <a href="#">3</a>
        <a href="#">4</a>
        <a href="#">5</a>
        <a href="#">6</a>
        <a href="#">&raquo;</a>
      </div>
    </b-row>
  </div>
</template>

<script>
export default {
  name: "MonitoringDataTable",
  data() {
    return {
      fields: [
        {
          key: "Дата загрузки",
          sortable: true,
        },
        {
          key: "Автор загрузки",
          sortable: true,
        },
        {
          key: "Недропользователь",
          sortable: true,
        },
        {
          key: "Месторождение",
          sortable: true,
        },
        {
          key: "Дата отбора начало",
          sortable: true,
        },
        {
          key: "Дата отбора конец",
          sortable: true,
        },
        {
          key: "Тип данных",
          sortable: true,
        },
      ],
      items: [
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
        {
          "Дата загрузки": "",
          "Автор загрузки": "",
          Недропользователь: "",
          Месторождение: "",
          "Дата отбора начало": "",
          "Дата отбора конец": "",
          "Тип данных": "",
        },
      ],
      currentPage: 1,
      perPage: 15,
      pageOptions: [15, 20, 25, { value: 100, text: "Показать больше" }],
    };
  },
};
</script>

<style>
.table_div {
  max-width: 960px;
  width: 100%;
  height: 100%;
  margin: 15px;
}
table,
th,
td {
  border: 1px solid #454d7d;
  background: #333975;
}
th,
td {
  padding: 15px;
}

#per-page-select {
  width: 20%;
  background: #1f2142;
  border-color: #454fa1;
  color: #fff;
}

.pagination {
  background: none;
}
.pagination > a {
  color: #fff;
  opacity: 0.5;
  padding: 6px 14px;
  float: right;
}

tr:nth-child(even) {
  background-color: #454d7d52;
}
.table_header {
  background-color: #333975;
  font-size: 12px;
  font-style: normal;
  font-weight: 700;
  line-height: 14px;
  letter-spacing: 0em;
  text-align: center;
  color: aliceblue;
}
</style>
