<?php

return array (
  'perMonth'=>'За месяц',
  'quarter' =>'Квартал',
  'months' => 
  array (
    1 => 'Февраль',
    2 => 'Март',
    3 => 'Апрель',
    4 => 'Май',
    5 => 'Июнь',
    6 => 'Июль',
    7 => 'Август',
    8 => 'Сентябрь',
    9 => 'Октябрь',
    10 => 'Ноябрь',
    11 => 'Декабрь',
    0 => 'Январь',
  ),
  'controlPanel' => 'Панель управления факторов',
  'selectFilterOption1' => 'Значение 1',
  'selectFilterOption2' => 'Значение 2',
  'exportSalesPercentage' => 
  array (
    'name' => '% реализации на экспорт',
    'option1' => 'По принятому плану (указать %)',
    'option2' => 'Экспорт 30%',
    'option3' => 'Экспорт 50%',
    'option4' => 'Экспорт 70%',
  ),
  'budgetExecution' => 'Исполнение бюджета',
  'proactiveFactors' => 'Упреждающие факторы',
  'valuationOfTheCompany' => 'Оценка стоимости компании',
  'versionBp' => 
  array (
    'option1' => 'Осн. план на 2021-2025 г.',
    'option2' => 'Корр. 1 на 2021-2025 г.',
    'option3' => 'Корр. 2 на 2021-2025 г.',
    'option4' => 'Корр. 6 на 2021-2025 г.',
    'name' => 'Версия БП',
  ),
  'company' => 
  array (
    'name' => 'Компании',
    'omg' => 'АО "ОзенМунайГаз"',
    'emg' => 'АО "Эмбамунайгаз"',
    'kbm' => 'АО "Каражанбасмунай"',
    'mmg' => 'АО "Мангистаумунайгаз"',
    'koa' => 'ТОО "Казахойл Актобе"',
    'ktm' => 'ТОО "Казахтуркмунай"',
    'kgm' => 'ТОО "КазГерМунай"',
  ),
  'priceBrent' => 
  array (
    'name' => 'Цена на нефть Brent',
    'option1' => 'По принятому плану (указать цену)',
    'option2' => 'на 2021-2025 г. 30-40-50-50-50',
    'option3' => 'на 2021-2025 г. 40-50-50-55-60',
    'option4' => 'на 2021-2025 г. 40-50-60-60-60',
  ),
  'priceInnerMarket' => 
  array (
    'name' => 'Цена на Внутренний рынок',
    'option1' => 'По принятому плану (указать цену)',
    'option2' => 'на 2021-2025 г. 67-68-70-73-75',
    'option3' => 'на 2021-2025 г. 67-68-75-80-80',
    'option4' => 'на 2021-2025 г. 70-75-75-80-80',
  ),
  'currency' => 
  array (
    'name' => 'Курс $/Тенге',
    'option1' => 'По принятому плану (указать цену)',
    'option2' => 'Корр. 1 на 2021-2025 г. 430-430-430-430-430',
    'option3' => 'Корр. 1 на 2021-2025 г. 450-450-450-450-450',
    'option4' => 'Корр. 1 на 2021-2025 г. 480-480-480-480-480',
  ),
  'getOil' => 
  array (
    'name' => 'Добыча нефти',
    'option1' => 'Снижение на 1%',
    'option2' => 'Снижение на 2%',
    'option3' => 'Снижение на 3%',
    'option4' => 'Снижение на 5%',
    'option5' => 'Увеличение на 1%',
    'option6' => 'Увеличение на 2%',
    'option7' => 'Увеличение на 3%',
    'option8' => 'Увеличение на 5%',
  ),
  'costAllocationBase' => 
  array (
    'name' => 'База распределения затрат',
    'option1' => 'По раздельному учету',
    'option2' => 'По скважинам',
  ),
  'capex' => 
  array (
    'name' => 'Capex',
    'option1' => 'Снижение на 5%',
    'option2' => 'Снижение на 10%',
    'option3' => 'Снижение на 15%',
    'option4' => 'Снижение на 20%',
  ),
  'applySettings' => 'Применить настройки',
  'repttTable' => 
  array (
    'sinceTheBeginningOfTheYear' => 'с начала года',
    'executionForTheReportingPeriod' => 'Исполнение за отчётный период',
    'factZa' => 'Факт за',
    'planNa' => 'План на',
    'name' => 'Наименование',
    'year' => 'год',
    'plan' => 'План',
    'absDeviation' => 'Абс. откл.',
    'relativeDeviation' => 'Отн. откл.',
    'unit' => 'Ед. изм.',
    'fact' => 'Факт',
    'january' => 'январь',
  ),
);
